app/controllers/locations_controller.rb

SELECT  "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT $2  [["id", 29], ["LIMIT", 1]]
DELETE FROM "locations" WHERE "locations"."id" = $1  [["id", 29]]
---
    def destroy
        @message = ''
        if params[:id]
            @location = Location.find(params[:id])
            @location.destroy