app/controllers/locations_controller.rb

SELECT "locations".* FROM "locations" WHERE "locations"."user_id" = $1  [["user_id", 1]]
SELECT "locations".* FROM "locations" WHERE "locations"."user_id" = $1  [["user_id", 4]]
INSERT INTO "locations" ("lat", "long", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["lat", "20.45836"], ["long", "55.22115"], ["user_id", 1], ["created_at", "2022-03-21 17:39:05.361786"], ["updated_at", "2022-03-21 17:39:05.361786"]]
---
    def list
        @user_id = 0
        if current_user
            @user_id = current_user.id
        end
        @locations = Location.all.where(user_id: @user_id )
        @location_list = Array.new
        @locations.each do |location|
            @location_list << {

SELECT "locations".* FROM "locations" WHERE "locations"."user_id" = $1  [["user_id", 4]]
INSERT INTO "locations" ("lat", "long", "user_id", "created_at", "updated_at", "name") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["lat", "-25.36"], ["long", "-44.33"], ["user_id", 4], ["created_at", "2022-03-30 13:56:28.228373"], ["updated_at", "2022-03-30 13:56:28.228373"], ["name", "mi casa"]]
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "tomasalvarez13@gmail.com"], ["LIMIT", 1]]
SELECT "locations".* FROM "locations" WHERE "locations"."user_id" = $1  [["user_id", 3]]
---
    def list_other
        @user_id = 0
        if current_user
            @user_id = current_user.id
        end
        @locations = Location.all.where(user_id: @user_id )
        @location_list = Array.new
        @locations.each do |location|
            @location_list << {
                :latlng => [location.lat, location.long]
            }
        end
        @other_user_mail = ""
        @other_location_list = Array.new
        if params[:email]
            @other_user_mail = params[:email]
            @other_user = User.where(email: params[:email]).first
            if @other_user

                @other_user_id = @other_user.id

                @other_locations = Location.all.where(user_id: @other_user_id )

                @other_locations.each do |location|

INSERT INTO "locations" ("lat", "long", "user_id", "created_at", "updated_at", "name") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["lat", "12.0"], ["long", "12.0"], ["user_id", 1], ["created_at", "2022-05-01 22:11:08.048350"], ["updated_at", "2022-05-01 22:11:08.048350"], ["name", "a"]]
INSERT INTO "locations" ("lat", "long", "user_id", "created_at", "updated_at", "name") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["lat", "15.0"], ["long", "10.0"], ["user_id", 2], ["created_at", "2022-05-01 22:15:46.490098"], ["updated_at", "2022-05-01 22:15:46.490098"], ["name", "hola"]]
---
    def create
        @location = Location.create(location_params)
        if @location.save

SELECT  "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "locations" WHERE "locations"."id" = $1  [["id", 3]]
---
    def destroy
        @location = Location.find(params[:id])
        @location.destroy