app/controllers/users/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "tomasalvarez@uc.cl"], ["LIMIT", 1]]
---
  def create_new
    if current_user
      print("HAY CURRENT USER\n")
      @message = 'You are already signed in'
      render 'sign_in', status: :ok, formats: [:json]
    else
      print("No hay current user\n")
    end
    user = User.find_by_email(params['email'].downcase)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def all_signed_out?
    users = Devise.mappings.keys.map { |s| warden.user(scope: s, run_callbacks: false) }